{
  "flowers": [
    {
      "id": 1,
      "name": "Rose",
      "color": "Red",
      "price": 10.99,
      "image": "./images/redrosey.jpg",
      "description": "Roses are multi-petal flowers available in an array of colours. Some varieties are known for their prickles along the stems of the plant, which are used to deter predators. Many species are now cultivated although there are still varieties that grow in the wild.",
      "link": "http://www.flowers.org.uk/flowers/flowers-names/q-t/rose/",
      "habitat": "Gardens, Wild",
      "species": "Rosa",
      "careTips": "Water regularly, ensure good sunlight, prune dead or faded flowers."
    },
    {
      "id": 2,
      "name": "Tulip",
      "color": "Yellow",
      "price": 7.99,
      "image": "./images/yellow tulip.jpg",
      "description": "Tulips symbolize perfect love. They come in a variety of colors and are known for their elegant appearance.",
      "link": "http://www.flowers.org.uk/flowers/flowers-names/q-t/tulip/",
      "habitat": "Gardens, Meadows",
      "species": "Tulipa",
      "careTips": "Plant in well-drained soil, water moderately, provide full or afternoon sun."
    },
    {
      "id": 3,
      "name": "Lily",
      "color": "White",
      "price": 12.99,
      "image": "./images/white lily.webp",
      "description": "Lilies represent purity and devotion. They are often associated with funerals and symbolize the soul's return to innocence.",
      "link": "http://www.flowers.org.uk/flowers/flowers-names/i-l/lily/",
      "habitat": "Gardens, Woodland",
      "species": "Lilium",
      "careTips": "Plant in well-drained soil, water regularly, protect from strong winds."
    },
    {
      "id": 4,
      "name": "Orchid",
      "color": "Purple",
      "price": 15.99,
      "image": "./images/purple orchid.jpg",
      "description": "Orchids symbolize love, luxury, and beauty. They are known for their exotic appearance and delicate fragrance.",
      "habitat": "Tropical, Subtropical",
      "species": "Orchidaceae",
      "careTips": "Maintain high humidity, indirect sunlight, water when the soil is dry."
    },
    {
      "id": 5,
      "name": "Daisy",
      "color": "Pink",
      "price": 5.99,
      "image": "./images/pink daisy.webp",
      "description": "Daisies symbolize innocence and purity. They are often given as a symbol of friendship and loyalty.",
      "habitat": "Meadows, Gardens",
      "species": "Bellis perennis",
      "careTips": "Water regularly, provide full sun to partial shade, deadhead to encourage blooms."
    },
    {
      "id": 6,
      "name": "Sunflower",
      "color": "Yellow",
      "price": 8.99,
      "image": "./images/mini_yellow_sunflowers.webp",
      "description": "Sunflowers symbolize adoration, loyalty, and longevity. They are known for their large, vibrant yellow petals and follow the movement of the sun throughout the day.",
      "habitat": "Sunflowers thrive in full sun and well-drained soil.",
      "species": "Helianthus annuus",
      "careTips": "Plant sunflower seeds in a sunny spot with well-drained soil. Keep the soil consistently moist but not waterlogged. Provide support for tall varieties. Deadhead spent blooms to encourage continuous flowering."
    },
    {
      "id": 7,
      "name": "Carnation",
      "color": "Red",
      "price": 6.99,
      "image": "./images/redcarnations.webp",
      "description": "Carnations symbolize love and affection. They are popular flowers for bouquets and arrangements, available in various colors including red, pink, white, and more.",
      "habitat": "Carnations prefer well-drained soil and full to partial sun.",
      "species": "Dianthus caryophyllus",
      "careTips": "Plant carnations in well-drained soil with good air circulation. Water deeply but allow the soil to dry slightly between waterings. Deadhead spent blooms to promote continuous flowering. Protect from frost in colder climates."
    },
    {
      "id": 8,
      "name": "Hyacinth",
      "color": "Blue",
      "price": 11.99,
      "image": "./images/blue_hyacinth_bouquet.webp",
      "description": "Hyacinths are fragrant spring flowers that symbolize sincerity and constancy. They come in various colors, including blue, white, pink, and purple.",
      "habitat": "Hyacinths thrive in well-drained soil and full to partial sun.",
      "species": "Hyacinthus orientalis",
      "careTips": "Plant hyacinth bulbs in the fall in a location with well-drained soil. Water after planting and keep the soil moist but not waterlogged. After flowering, allow the foliage to die back naturally to replenish the bulb for next year."
    },
    {
      "id": 9,
      "name": "Daffodil",
      "color": "White",
      "price": 9.99,
      "image": "./images/daffodil.webp",
      "description": "Daffodils symbolize new beginnings and rebirth. They are often associated with spring and represent happiness, joy, and positive energy.",
      "habitat": "Daffodils prefer well-drained soil and full to partial sun.",
      "species": "Narcissus",
      "careTips": "Plant daffodil bulbs in the fall in well-drained soil. Water after planting and keep the soil evenly moist. Allow the foliage to die back naturally after flowering to nourish the bulb for the next season."
    },
    {
      "id": 10,
      "name": "Iris",
      "color": "Purple",
      "price": 13.99,
      "image": "./images/siberian-iris-purple-1.webp",
      "description": "Irises symbolize faith, hope, and wisdom. They are elegant flowers known for their unique shape and vibrant colors, including shades of purple, blue, yellow, and white.",
      "habitat": "Irises prefer well-drained soil and full sun.",
      "species": "Iris germanica",
      "careTips": "Plant iris rhizomes in the summer or early fall in well-drained soil. Ensure the rhizomes are partially exposed above the soil surface. Water deeply after planting and keep the soil evenly moist. Divide overcrowded clumps every few years."
    },
    {
      "id": 11,
      "name": "Lavender",
      "color": "Purple",
      "price": 14.99,
      "image": "./images/lavenderpurple.jpg",
      "description": "Lavender symbolizes calmness, purity, and devotion. It is known for its soothing fragrance and beautiful purple flowers, often used in aromatherapy and herbal remedies.",
      "habitat": "Lavender thrives in well-drained soil and full sun.",
      "species": "Lavandula",
      "careTips": "Plant lavender in well-drained soil with good air circulation. Water deeply after planting and then allow the soil to dry out between waterings. Prune after flowering to maintain shape and encourage bushiness. Avoid over-fertilizing."
    },
    {
      "id": 12,
      "name": "Marigold",
      "color": "Orange",
      "price": 4.99,
      "image": "./images/marigold.jpg",
      "description": "Marigolds symbolize warmth, positivity, and creativity. They are vibrant flowers with shades of orange and yellow, commonly used in festive decorations and traditional ceremonies.",
      "habitat": "Marigolds thrive in full sun and well-drained soil.",
      "species": "Tagetes",
      "careTips": "Plant marigold seeds or transplants in a sunny location with well-drained soil. Water regularly, allowing the soil to dry out between waterings. Deadhead spent blooms to encourage continuous flowering. Watch for pests like aphids and caterpillars."
    },
    {
      "id": 13,
      "name": "Peony",
      "color": "Pink",
      "price": 16.99,
      "image": "./images/pinkpeony.jpg",
      "description": "Peonies symbolize romance, prosperity, and good fortune. They are lush, fragrant flowers with delicate petals, often used in bridal bouquets and garden landscapes.",
      "habitat": "Peonies prefer fertile, well-drained soil and full sun to partial shade.",
      "species": "Paeonia",
      "careTips": "Plant peonies in a location with good air circulation and ample sunlight. Ensure the soil is well-drained and rich in organic matter. Water deeply but infrequently, allowing the soil to dry slightly between waterings. Provide support for heavy blooms to prevent bending or breaking."
    },
    {
      "id": 14,
      "name": "Chrysanthemum",
      "color": "Yellow",
      "price": 7.49,
      "image": "./images/chrysanthemum.avif",
      "description": "Chrysanthemums symbolize loyalty, friendship, and joy. They come in various colors, including yellow, white, red, and purple, and are popular flowers for floral arrangements and gardens.",
      "habitat": "Chrysanthemums prefer well-drained soil and full sun.",
      "species": "Chrysanthemum",
      "careTips": "Plant chrysanthemum in well-drained soil with good air circulation. Water deeply but allow the soil to dry slightly between waterings. Pinch back stems in early summer to encourage bushiness and more flower buds."
    },
    {
      "id": 15,
      "name": "Azalea",
      "color": "Pink",
      "price": 9.49,
      "image": "./images/pink azalea.jpg",
      "description": "Azaleas symbolize femininity, elegance, and beauty. They are flowering shrubs with vibrant pink blooms, often used as ornamental plants in gardens and landscapes.",
      "habitat": "Azaleas prefer well-drained, acidic soil and partial shade.",
      "species": "Rhododendron",
      "careTips": "Plant azaleas in acidic soil with good drainage. Provide partial shade, especially during the hottest part of the day. Keep the soil consistently moist but not waterlogged. Mulch around the base of the plant to conserve moisture and regulate soil temperature."
    },
    {
      "id": 16,
      "name": "Begonia",
      "color": "Red",
      "price": 10.49,
      "image": "./images/red begonia.jpg",
      "description": "Begonias symbolize love, passion, and courage. They are versatile plants with colorful flowers and foliage, suitable for both indoor and outdoor cultivation.",
      "habitat": "Begonias prefer well-drained soil and partial shade.",
      "species": "Begonia",
      "careTips": "Plant begonias in well-drained soil with partial shade, especially in hot climates. Water consistently, allowing the soil to dry out slightly between waterings. Deadhead spent blooms regularly to encourage continuous flowering. Protect from frost in cooler climates."
    },
    {
      "id": 17,
      "name": "Bluebell",
      "color": "Blue",
      "price": 6.49,
      "image": "./images/blue bluebell.avif",
      "description": "Bluebells symbolize humility, gratitude, and everlasting love. They are delicate, bell-shaped flowers with hues of blue, often found in woodlands and gardens during springtime.",
      "habitat": "Bluebells prefer partial shade and moist, well-drained soil.",
      "species": "Hyacinthoides non-scripta",
      "careTips": "Plant bluebells in partial shade, preferably under deciduous trees. Ensure the soil is moist and well-drained, especially during the growing season. Avoid disturbing naturalized bulbs once planted. Allow foliage to die back naturally after flowering to nourish bulbs for the following year."
    },
    {
      "id": 18,
      "name": "Camellia",
      "color": "Pink",
      "price": 12.49,
      "image": "./images/pink camelia.jpg",
      "description": "Camellias symbolize admiration, love, and gratitude. They are elegant flowers with lush petals and glossy foliage, popular in floral arrangements and as ornamental shrubs.",
      "habitat": "Camellias prefer acidic, well-drained soil and partial shade.",
      "species": "Camellia",
      "careTips": "Plant camellias in acidic soil with good drainage. Provide partial shade, especially during the hottest part of the day. Keep the soil consistently moist but not waterlogged. Mulch around the base of the plant to conserve moisture and regulate soil temperature."
    },
    {
      "id": 19,
      "name": "Crocus",
      "color": "Purple",
      "price": 5.49,
      "image": "./images/purple crocus.jpg",
      "description": "Crocuses symbolize youthfulness, cheerfulness, and happiness. They are early spring flowers with bright purple blooms, signaling the arrival of warmer weather and new beginnings.",
      "habitat": "Crocuses prefer well-drained soil and full sun to partial shade.",
      "species": "Crocus",
      "careTips": "Plant crocus bulbs in the fall in well-drained soil. Water after planting and keep the soil evenly moist. Allow the foliage to die back naturally after flowering to nourish the bulbs for the next season."
    },
    {
      "id": 20,
      "name": "Dahlia",
      "color": "Red",
      "price": 11.49,
      "image": "./images/red dahlia.jpg",
      "description": "Dahlias symbolize elegance, inner strength, and dignity. They are vibrant flowers with bold red hues and intricate petal formations, popular in floral displays and garden landscapes.",
      "habitat": "Dahlias prefer well-drained soil and full sun.",
      "species": "Dahlia",
      "careTips": "Plant dahlia tubers in the spring after the danger of frost has passed. Ensure well-drained soil and full sun. Water deeply and regularly, especially during dry periods. Provide support for taller varieties. Deadhead spent blooms to encourage continuous flowering."
    }
,
{
  "id": 21,
  "name": "Gardenia",
  "color": "White",
  "price": 13.49,
  "image": "./images/white gardenia.jpg",
  "description": "Gardenias symbolize purity, innocence, and grace. They are fragrant flowers with creamy white blooms and glossy green leaves, often used in bridal bouquets and corsages.",
  "habitat": "Gardenias prefer acidic, well-drained soil and partial shade.",
  "species": "Gardenia jasminoides",
  "careTips": "Plant gardenias in acidic soil with good drainage. Provide partial shade, especially during the hottest part of the day. Keep the soil consistently moist but not waterlogged. Mulch around the base of the plant to conserve moisture and regulate soil temperature."
},
{
  "id": 22,
  "name": "Geranium",
  "color": "Pink",
  "price": 7.99,
  "image": "./images/pink geranium.jpg",
  "description": "Geraniums symbolize friendship, happiness, and positivity. They are versatile plants with colorful flowers and fragrant foliage, suitable for both indoor and outdoor cultivation.",
  "habitat": "Geraniums thrive in well-drained soil and full sun to partial shade.",
  "species": "Pelargonium",
  "careTips": "Plant geraniums in well-drained soil with good air circulation. Water deeply but allow the soil to dry slightly between waterings. Pinch back leggy growth to encourage bushiness. Deadhead spent blooms regularly to promote continuous flowering."
},
{
  "id": 23,
  "name": "Gladiolus",
  "color": "Red",
  "price": 9.99,
  "image": "./images/red gladiolus.jpg",
  "description": "Gladiolus symbolizes strength, integrity, and sincerity. They are tall, sword-shaped flowers with vibrant red blossoms, commonly used in floral arrangements and bouquets to convey admiration and respect.",
  "habitat": "Gladiolus prefer well-drained soil and full sun.",
  "species": "Gladiolus",
  "careTips": "Plant gladiolus corms in the spring after the danger of frost has passed. Ensure well-drained soil and full sun. Water deeply and regularly, especially during dry periods. Stake tall varieties to prevent bending or snapping."
},
{
  "id": 24,
  "name": "Heather",
  "color": "Purple",
  "price": 6.99,
  "image": "./images/purple heather.jpg",
  "description": "Heather symbolizes admiration, good luck, and protection. They are low-growing shrubs with tiny purple flowers, often found in heathlands and moorlands, and are associated with spirituality and healing.",
  "habitat": "Heather thrives in acidic, well-drained soil and full sun to partial shade.",
  "species": "Calluna vulgaris",
  "careTips": "Plant heather in acidic soil with good drainage. Provide full sun to partial shade, depending on the variety. Water regularly, especially during dry spells. Prune after flowering to maintain shape and promote bushiness."
},
{
  "id": 25,
  "name": "Hibiscus",
  "color": "Red",
  "price": 14.99,
  "image": "./images/red hibiscus.jpg",
  "description": "Hibiscus symbolizes beauty, passion, and femininity. They are large, trumpet-shaped flowers with rich red hues, commonly seen in tropical regions and gardens, and are used in herbal teas and skincare products for their soothing properties.",
  "habitat": "Hibiscus prefer fertile, well-drained soil and full sun.",
  "species": "Hibiscus rosa-sinensis",
  "careTips": "Plant hibiscus in fertile, well-drained soil in a sunny location. Water deeply and regularly, especially during dry spells. Prune to shape and remove dead or damaged branches. Apply a balanced fertilizer during the growing season."
},
{
  "id": 26,
  "name": "Hollyhock",
  "color": "Pink",
  "price": 8.49,
  "image": "./images/pink hollihock.jpg",
  "description": "Hollyhocks symbolize abundance, fertility, and protection. They are tall, biennial plants with showy pink flowers, often grown along garden borders and fences, attracting butterflies and hummingbirds with their nectar-rich blooms.",
  "habitat": "Hollyhocks prefer well-drained soil and full sun.",
  "species": "Alcea rosea",
  "careTips": "Plant hollyhock seeds or transplants in a location with full sun and well-drained soil. Provide support for tall stems to prevent them from bending or breaking in the wind. Water deeply but infrequently, allowing the soil to dry out slightly between waterings. Deadhead spent blooms to promote continuous flowering."
},
{
  "id": 27,
  "name": "Jasmine",
  "color": "White",
  "price": 12.99,
  "image": "./images/white jasmine.jpg",
  "description": "Jasmine symbolizes purity, love, and grace. They are fragrant flowers with delicate white petals, prized for their sweet aroma and ornamental value. Jasmine flowers are used in perfumery, tea blending, and religious ceremonies.",
  "habitat": "Jasmine prefers well-drained soil and full sun to partial shade.",
  "species": "Jasminum",
  "careTips": "Plant jasmine in well-drained soil with full sun to partial shade. Water regularly, especially during the growing season, and mulch to retain moisture. Prune lightly after flowering to maintain shape and encourage new growth. Protect from frost in cooler climates."
},
{
  "id": 28,
  "name": "Lilac",
  "color": "Purple",
  "price": 11.99,
  "image": "./images/purple lilac.jpg",
  "description": "Lilacs symbolize renewal, innocence, and youthful vitality. They are small trees or shrubs with clusters of purple flowers, emitting a strong, sweet fragrance that heralds the arrival of spring. Lilacs are popular ornamental plants in gardens and parks.",
  "habitat": "Lilacs prefer well-drained soil and full sun.",
  "species": "Syringa",
  "careTips": "Plant lilacs in well-drained soil with full sun exposure. Water deeply but infrequently, allowing the soil to dry out slightly between waterings. Prune after flowering to remove spent blooms and shape the plant. Apply a balanced fertilizer in early spring to promote healthy growth."
},
{
  "id": 29,
  "name": "Lotus",
  "color": "Pink",
  "price": 13.99,
  "image": "./images/pink lotus.jpg",
  "description": "Lotus symbolizes purity, enlightenment, and spiritual growth. They are aquatic plants with large, showy pink flowers that float on the surface of ponds and lakes. Lotus flowers are revered in many cultures for their symbolic significance and are often used in religious ceremonies.",
  "habitat": "Lotus prefer still, shallow water and full sun.",
  "species": "Nelumbo nucifera",
  "careTips": "Plant lotus tubers in containers or directly into pond soil with still, shallow water and full sun exposure. Provide a layer of clay or loamy soil and fertilizer tablets at the bottom of the container. Maintain water temperature above 75°F (24°C) for optimal growth. Fertilize monthly during the growing season."
},
{
  "id": 30,
  "name": "Magnolia",
  "color": "White",
  "price": 15.99,
  "image": "./images/white magnolia.jpg",
  "description": "Magnolia symbolizes beauty, dignity, and perseverance. They are deciduous or evergreen trees with fragrant white flowers, appearing in early spring before the leaves emerge. Magnolia flowers are admired for their elegant form and are associated with nobility and resilience.",
  "habitat": "Magnolias prefer rich, well-drained soil and full sun to partial shade.",
  "species": "Magnolia",
  "careTips": "Plant magnolias in rich, well-drained soil with full sun to partial shade. Water deeply and regularly, especially during the first growing season. Mulch around the base of the tree to retain moisture and regulate soil temperature. Prune lightly to shape the tree and remove dead or damaged branches."
},
{
  "id": 31,
  "name": "Narcissus",
  "color": "Yellow",
  "price": 9.49,
  "image": "./images/yellow narcissus.jpg",
  "description": "Narcissus symbolizes rebirth, renewal, and new beginnings. They are bulbous plants with trumpet-shaped yellow flowers, blooming in early spring and often found in gardens and landscapes. Narcissus flowers are known for their cheerful appearance and are used in floral arrangements and bouquets.",
  "habitat": "Narcissus prefer well-drained soil and full sun to partial shade.",
  "species": "Narcissus",
  "careTips": "Plant narcissus bulbs in the fall in well-drained soil. Choose a location with full sun to partial shade. Water regularly during the growing season but reduce watering after flowering. Allow foliage to die back naturally to nourish bulbs for the next season."
},
{
  "id": 32,
  "name": "Pansy",
  "color": "Purple",
  "price": 4.49,
  "image": "./images/pansy purple.jpg",
  "description": "Pansy symbolizes thoughtfulness, remembrance, and affection. They are colorful flowers with distinctive faces, available in various shades of purple, blue, yellow, and white. Pansies are popular garden plants and are often used in borders, containers, and bedding displays.",
  "habitat": "Pansies prefer cool temperatures and well-drained soil.",
  "species": "Viola tricolor",
  "careTips": "Plant pansies in early spring or fall in well-drained soil. Choose a location with full sun to partial shade. Water regularly, especially during dry spells. Deadhead spent blooms to promote continuous flowering and prevent self-seeding."
},
{
  "id": 33,
  "name": "Petunia",
  "color": "Pink",
  "price": 5.99,
  "image": "./images/pink petunia.jpg",
  "description": "Petunia symbolizes gratitude, appreciation, and charm. They are flowering plants with trumpet-shaped blooms in shades of pink, purple, red, and white. Petunias are versatile garden plants, suitable for hanging baskets, containers, and flower beds, adding color and beauty to any landscape.",
  "habitat": "Petunias prefer full sun and well-drained soil.",
  "species": "Petunia",
  "careTips": "Plant petunias in well-drained soil in a location with full sun exposure. Water regularly, especially during hot, dry weather. Deadhead spent blooms regularly to promote continuous flowering. Apply a balanced fertilizer every few weeks during the growing season."
},
{
  "id": 34,
  "name": "Poppy",
  "color": "Red",
  "price": 6.99,
  "image": "./images/red poppy.jpg",
  "description": "Poppy symbolizes remembrance, peace, and consolation. They are vibrant red flowers with delicate petals, often associated with commemorative ceremonies and memorial services. Poppies are also valued for their medicinal properties and are used in herbal remedies and cosmetics.",
  "habitat": "Poppies prefer well-drained soil and full sun.",
  "species": "Papaver",
  "careTips": "Plant poppies in well-drained soil in a location with full sun exposure. Water regularly, especially during dry spells, but avoid overwatering. Deadhead spent blooms to promote continuous flowering and prevent self-seeding. Apply a thin layer of mulch to retain moisture and suppress weeds."
},
{
  "id": 35,
  "name": "Snapdragon",
  "color": "Yellow",
  "price": 7.99,
  "image": "./images/yellow snapdragon.jpg",
  "description": "Snapdragon symbolizes grace, strength, and resilience. They are tall, colorful flowers with clusters of blooms along the stem, available in various shades of yellow, orange, pink, and white. Snapdragons are popular garden plants and are often used in floral arrangements and cut flower displays.",
  "habitat": "Snapdragons prefer well-drained soil and full sun.",
  "species": "Antirrhinum",
  "careTips": "Plant snapdragons in well-drained soil in a location with full sun exposure. Water regularly, especially during dry spells, but avoid overwatering. Deadhead spent blooms regularly to promote continuous flowering. Cut back leggy growth to encourage bushiness."
},
{
  "id": 36,
  "name": "Snowdrop",
  "color": "White",
  "price": 8.99,
  "image": "./images/white snowdrop.jpg",
  "description": "Snowdrop symbolizes hope, purity, and renewal. They are small, delicate flowers with drooping white petals, blooming in late winter or early spring. Snowdrops are often found in woodlands, gardens, and parks, signaling the arrival of spring and the end of winter dormancy.",
  "habitat": "Snowdrops prefer moist, well-drained soil and partial shade.",
  "species": "Galanthus",
  "careTips": "Plant snowdrop bulbs in moist, well-drained soil in early fall. Choose a location with partial shade, especially in regions with hot summers. Water regularly during the growing season but reduce watering after flowering. Allow foliage to die back naturally to nourish bulbs for the next season."
},
{
  "id": 37,
  "name": "Sweet Pea",
  "color": "Pink",
  "price": 6.49,
  "image": "./images/pink sweetpea.jpg",
  "description": "Sweet pea symbolizes blissful pleasure, delicate pleasure, and gratitude. They are fragrant flowers with colorful blooms in shades of pink, purple, blue, and white. Sweet peas are beloved for their sweet fragrance and are often used in bouquets, corsages, and floral arrangements.",
  "habitat": "Sweet peas prefer well-drained soil and full sun.",
  "species": "Lathyrus odoratus",
  "careTips": "Plant sweet peas in well-drained soil with full sun exposure. Provide support such as trellises or stakes for climbing varieties. Water regularly, especially during dry spells, and mulch to conserve moisture. Deadhead spent blooms regularly to promote continuous flowering."
},
{
  "id": 38,
  "name": "Tiger Lily",
  "color": "Orange",
  "price": 11.49,
  "image": "./images/orange tigerlily.jpg",
  "description": "Tiger Lily symbolizes pride, confidence, and courage. They are vibrant orange flowers with dark spots and recurved petals, resembling the stripes of a tiger. Tiger lilies are popular garden plants and are often associated with strength and resilience.",
  "habitat": "Tiger lilies prefer well-drained soil and full sun to partial shade.",
  "species": "Lilium lancifolium",
  "careTips": "Plant tiger lilies in well-drained soil with full sun to partial shade. Water regularly, especially during the growing season, but avoid overwatering. Mulch around the base of the plants to conserve moisture and suppress weeds. Deadhead spent blooms to promote continuous flowering."
},
{
  "id": 39,
  "name": "Violet",
  "color": "Purple",
  "price": 5.99,
  "image": "./images/purple violet.jpeg",
  "description": "Violet symbolizes loyalty, devotion, and spirituality. They are small, delicate flowers with five petals, available in shades of purple, blue, white, and yellow. Violets are often used as symbols of remembrance and are associated with sentiments of love and faithfulness.",
  "habitat": "Violets prefer moist, well-drained soil and partial shade.",
  "species": "Viola",
  "careTips": "Plant violets in moist, well-drained soil in a location with partial shade, especially in regions with hot summers. Water regularly, especially during dry spells, but avoid overwatering. Mulch around the base of the plants to conserve moisture and suppress weeds. Deadhead spent blooms regularly to promote continuous flowering."
},
{
  "id": 40,
  "name": "Zinnia",
  "color": "Red",
  "price": 4.99,
  "image": "./images/red zinnia.jpg",
  "description": "Zinnia symbolizes endurance, friendship, and optimism. They are colorful flowers with single or double blooms in shades of red, orange, pink, yellow, and white. Zinnias are easy-to-grow garden plants and are valued for their long-lasting blooms and vibrant colors.",
  "habitat": "Zinnias prefer well-drained soil and full sun.",
  "species": "Zinnia elegans",
  "careTips": "Plant zinnias in well-drained soil with full sun exposure. Water regularly, especially during hot, dry weather, but avoid overwatering. Deadhead spent blooms regularly to promote continuous flowering and prevent self-seeding. Apply a balanced fertilizer every few weeks during the growing season."
},
{
  "id": 41,
  "name": "Forsythia",
  "color": "Yellow",
  "price": 7.49,
  "image": "./images/Forsythia_flower.JPG",
  "description": "Forsythia symbolizes anticipation, hope, and new beginnings. They are deciduous shrubs with bright yellow flowers that bloom in early spring. Forsythias are often planted as ornamental bushes and are valued for their cheerful blooms that signal the arrival of spring.",
  "habitat": "Forsythias prefer well-drained soil and full sun to partial shade.",
  "species": "Forsythia",
  "careTips": "Plant forsythias in well-drained soil with full sun to partial shade exposure. Water regularly, especially during the first growing season, but reduce watering once established. Prune after flowering to remove dead or damaged branches and shape the plant."
},
{
  "id": 42,
  "name": "Foxglove",
  "color": "Purple",
  "price": 8.49,
  "image": "./images/purple foxglove.jpg",
  "description": "Foxglove symbolizes healing, protection, and intuition. They are tall, spiky plants with bell-shaped flowers in shades of purple, pink, white, and yellow. Foxgloves are poisonous if ingested but are valued for their ornamental beauty and are often used in cottage gardens and woodland landscapes.",
  "habitat": "Foxgloves prefer rich, well-drained soil and partial to full shade.",
  "species": "Digitalis purpurea",
  "careTips": "Plant foxgloves in rich, well-drained soil in a location with partial to full shade exposure. Water regularly, especially during dry spells, but avoid overwatering. Deadhead spent blooms to promote continuous flowering and prevent self-seeding. Protect from strong winds."
},
{
  "id": 43,
  "name": "Freesia",
  "color": "Yellow",
  "price": 6.49,
  "image": "./images/yellow freesia.jpg",
  "description": "Freesia symbolizes friendship, innocence, and trust. They are fragrant flowers with funnel-shaped blooms in shades of white, yellow, pink, purple, and orange. Freesias are often used in bouquets and floral arrangements for their delightful fragrance and delicate appearance.",
  "habitat": "Freesias prefer well-drained soil and full sun.",
  "species": "Freesia",
  "careTips": "Plant freesia bulbs in well-drained soil with full sun exposure. Provide support such as stakes for taller varieties. Water regularly, especially during dry spells, but avoid overwatering. Deadhead spent blooms regularly to promote continuous flowering."
},
{
  "id": 44,
  "name": "Garden Pink",
  "color": "Pink",
  "price": 5.49,
  "image": "./images/gardenpink.jpg",
  "description": "Garden Pink symbolizes admiration, gratitude, and joy. They are perennial plants with clusters of fragrant pink flowers that bloom from spring to summer. Garden pinks are popular garden plants and are valued for their long-lasting blooms and compact growth habit.",
  "habitat": "Garden pinks prefer well-drained soil and full sun to partial shade.",
  "species": "Dianthus plumarius",
  "careTips": "Plant garden pinks in well-drained soil with full sun to partial shade exposure. Water regularly, especially during dry spells, but avoid overwatering. Deadhead spent blooms regularly to promote continuous flowering. Divide overcrowded clumps every few years to rejuvenate the plant."
},
{
  "id": 45,
  "name": "Goldenrod",
  "color": "Yellow",
  "price": 6.99,
  "image": "./images/yellow goldenrod.jpg",
  "description": "Goldenrod symbolizes encouragement, prosperity, and good fortune. They are tall, upright plants with bright yellow flower spikes that bloom in late summer or early fall. Goldenrods are often planted in wildflower gardens and prairie landscapes and are valued for their vibrant color and ability to attract pollinators.",
  "habitat": "Goldenrods prefer well-drained soil and full sun.",
  "species": "Solidago",
  "careTips": "Plant goldenrods in well-drained soil with full sun exposure. Water regularly, especially during dry spells, but avoid overwatering. Deadhead spent blooms regularly to promote continuous flowering. Divide clumps every few years to control growth and rejuvenate the plant."
},
{
  "id": 47,
  "name": "Hellebore",
  "color": "Purple",
  "price": 9.99,
  "image": "./images/purple hellebore.jpg",
  "description": "Hellebore, also known as Christmas rose or Lenten rose, symbolizes serenity, tranquility, and rebirth. It is a perennial flowering plant with large, showy flowers in shades of white, pink, purple, green, and red. Hellebores are early bloomers, often flowering in late winter or early spring, making them a welcome sight in the garden during the colder months.",
  "habitat": "Hellebores prefer fertile, well-drained soil and partial to full shade.",
  "species": "Helleborus",
  "careTips": "Plant hellebores in fertile, well-drained soil with partial to full shade exposure. Water regularly, especially during dry spells, but avoid overwatering. Mulch around the base of the plants to retain moisture and suppress weeds. Remove old foliage in late winter to showcase the new blooms."
},
{
  "id": 48,
  "name": "Honeysuckle",
  "color": "Yellow",
  "price": 7.49,
  "image": "./images/yellow honeysuckle.jpg",
  "description": "Honeysuckle symbolizes love, happiness, and devotion. It is a climbing vine with fragrant flowers that come in various colors, including white, yellow, pink, and orange. Honeysuckle flowers attract hummingbirds and butterflies and are prized for their sweet scent and ornamental value in gardens and landscapes.",
  "habitat": "Honeysuckles prefer well-drained soil and full sun to partial shade.",
  "species": "Lonicera",
  "careTips": "Plant honeysuckles in well-drained soil with full sun to partial shade exposure. Provide support such as trellises or fences for climbing varieties. Water regularly, especially during dry spells, but avoid overwatering. Prune after flowering to control growth and remove old or damaged branches."
},
{
  "id": 49,
  "name": "Morning Glory",
  "color": "Blue",
  "price": 5.99,
  "image": "./images/blue morningglory.jpg",
  "description": "Morning Glory symbolizes affection, love, and mortality. It is a fast-growing vine with trumpet-shaped flowers that bloom in shades of blue, purple, pink, white, and red. Morning glories are often planted along fences, trellises, and walls, and their blooms open in the morning and close in the afternoon, giving them their name.",
  "habitat": "Morning glories prefer well-drained soil and full sun exposure.",
  "species": "Ipomoea",
  "careTips": "Plant morning glories in well-drained soil with full sun exposure. Provide support such as trellises or fences for climbing varieties. Water regularly, especially during dry spells, but avoid overwatering. Deadhead spent blooms regularly to promote continuous flowering."
},
{
  "id": 50,
  "name": "Primrose",
  "color": "Yellow",
  "price": 6.49,
  "image": "./images/yellow primrose.jpg",
  "description": "Primrose symbolizes youth, new beginnings, and protection. It is a low-growing perennial plant with colorful flowers that bloom in early spring. Primroses come in various colors, including yellow, pink, purple, blue, and white, and are often planted in gardens, borders, and containers to add color and cheer to the landscape.",
  "habitat": "Primroses prefer moist, well-drained soil and partial to full shade exposure.",
  "species": "Primula",
  "careTips": "Plant primroses in moist, well-drained soil with partial to full shade exposure. Water regularly to keep the soil consistently moist but not waterlogged. Deadhead spent blooms regularly to promote continuous flowering. Divide clumps every few years to rejuvenate the plant."
},
{
  "id": 51,
  "name": "Anemone",
  "color": "Red",
  "price": 9.99,
  "image": "./images/red anemone.jpg",
  "description": "Anemones symbolize anticipation and are known for their vibrant colors and delicate petals.",
  "habitat": "Anemones prefer well-drained soil and partial shade to full sun exposure.",
  "species": "Anemone",
  "careTips": "Plant anemones in well-drained soil with partial shade to full sun exposure. Water regularly, especially during dry spells, but avoid overwatering. Mulch around the base of the plants to retain moisture and suppress weeds. Divide clumps every few years to control growth and rejuvenate the plant."
},
{
  "id": 52,
  "name": "Bleeding Heart",
  "color": "Pink",
  "price": 11.99,
  "image": "./images/pink bleedingheart.jpg",
  "description": "Bleeding Hearts represent love and compassion. They are noted for their heart-shaped flowers.",
  "habitat": "Bleeding hearts prefer moist, well-drained soil and partial shade exposure.",
  "species": "Lamprocapnos spectabilis",
  "careTips": "Plant bleeding hearts in moist, well-drained soil with partial shade exposure. Water regularly to keep the soil consistently moist but not waterlogged. Mulch around the base of the plants to retain moisture and suppress weeds. Divide clumps every few years to control growth and rejuvenate the plant."
},
{
  "id": 53,
  "name": "Buttercup",
  "color": "Yellow",
  "price": 5.99,
  "image": "./images/buttercup.jpg",
  "description": "Buttercups symbolize neatness and humility. They are often found in meadows and fields.",
  "habitat": "Buttercups prefer moist, well-drained soil and full sun to partial shade exposure.",
  "species": "Ranunculus",
  "careTips": "Plant buttercups in moist, well-drained soil with full sun to partial shade exposure. Water regularly to keep the soil consistently moist but not waterlogged. Deadhead spent blooms regularly to promote continuous flowering. Divide clumps every few years to control growth and rejuvenate the plant."
},
{
  "id": 54,
  "name": "Calla Lily",
  "color": "White",
  "price": 14.99,
  "image": "./images/whitecallalily.jpg",
  "description": "Calla Lilies represent purity and faithfulness. They are often used in weddings and funeral arrangements.",
  "habitat": "Calla lilies prefer moist, well-drained soil and partial shade to full sun exposure.",
  "species": "Zantedeschia",
  "careTips": "Plant calla lilies in moist, well-drained soil with partial shade to full sun exposure. Water regularly to keep the soil consistently moist but not waterlogged. Mulch around the base of the plants to retain moisture and suppress weeds. Remove old foliage after blooming to promote new growth."
},
{
  "id": 55,
  "name": "Cosmos",
  "color": "Pink",
  "price": 8.99,
  "image": "./images/pinkcosmos.jpg",
  "description": "Cosmos symbolize harmony and tranquility. They are known for their colorful, daisy-like flowers.",
  "habitat": "Cosmos prefer well-drained soil and full sun exposure.",
  "species": "Cosmos bipinnatus",
  "careTips": "Plant cosmos in well-drained soil with full sun exposure. Water regularly, especially during dry spells, but avoid overwatering. Deadhead spent blooms regularly to promote continuous flowering. Cosmos are self-seeding annuals and may need thinning to control growth."
},{
  "id": 56,
  "name": "Delphinium",
  "color": "Blue",
  "price": 10.99,
  "image": "./images/bluedelphinium.jpg",
  "description": "Delphiniums represent boldness and grace. They are tall, spiked flowers that add height to garden arrangements.",
  "habitat": "Delphiniums are native to the Northern Hemisphere, primarily found in temperate regions of Europe, Asia, and North America.",
  "species": "There are over 300 species of Delphinium, including annuals, biennials, and perennials.",
  "careTips": "Delphiniums prefer full sun to partial shade and well-drained soil. They require regular watering, especially during dry periods. Support tall varieties with stakes to prevent them from flopping over."
},
{
  "id": 57,
  "name": "Foxglove",
  "color": "Purple",
  "price": 9.49,
  "image": "./images/foxglove.jpg",
  "description": "Foxgloves symbolize confidence and creativity. They have tall, tubular flowers that attract hummingbirds.",
  "habitat": "Foxgloves are native to Europe, western Asia, and North Africa, and they thrive in woodland areas, along roadsides, and in gardens.",
  "species": "Common species include Digitalis purpurea and Digitalis grandiflora.",
  "careTips": "Foxgloves prefer partial shade and moist, well-drained soil. They are biennial plants, meaning they flower every other year. Deadhead spent flowers to encourage continuous blooming and prevent self-seeding."
},
{
  "id": 58,
  "name": "Heliotrope",
  "color": "Purple",
  "price": 11.49,
  "image": "./images/heliotrope.jpg",
  "description": "Heliotropes represent eternal love and devotion. They have a sweet fragrance and attract butterflies.",
  "habitat": "Heliotropes are native to Peru and thrive in warm climates. They are often grown as annuals or tender perennials in temperate regions.",
  "species": "The most commonly cultivated species is Heliotropium arborescens.",
  "careTips": "Heliotropes prefer full sun to partial shade and well-drained soil. Keep the soil consistently moist but not waterlogged. Pinch back growing tips to encourage bushier growth and more flowers."
},
{
  "id": 59,
  "name": "Lupine",
  "color": "Blue",
  "price": 7.99,
  "image": "./images/bluelupine.jpg",
  "description": "Lupines symbolize imagination and admiration. They have tall spires of densely packed flowers.",
  "habitat": "Lupines are native to North and South America, Europe, and North Africa. They are often found in meadows, woodlands, and along riverbanks.",
  "species": "There are hundreds of Lupinus species, including both annual and perennial varieties.",
  "careTips": "Lupines prefer full sun and well-drained, slightly acidic soil. They have deep taproots, so they don't transplant well once established. Deadhead spent flowers to prolong blooming and prevent self-seeding."
},
{
  "id": 60,
  "name": "Ranunculus",
  "color": "Pink",
  "price": 12.99,
  "image": "./images/orangeranunculus.jpg",
  "description": "Ranunculus flowers symbolize charm and attractiveness. They are known for their layered, rose-like petals.",
  "habitat": "Ranunculus species are native to Asia, Europe, and North America. They thrive in cool, temperate climates and are often cultivated as ornamental plants.",
  "species": "The most commonly cultivated species is Ranunculus asiaticus.",
  "careTips": "Ranunculus prefer full sun to partial shade and well-drained soil. Plant tubers in the fall for spring blooms, and water sparingly to avoid rotting tubers. Protect from strong winds to prevent damage to delicate stems and flowers."
},
{
  "id": 61,
  "name": "Scabiosa",
  "color": "Purple",
  "price": 6.99,
  "image": "./images/whitescabiosa.jpg",
  "description": "Scabiosas symbolize love and purity. They are also known as 'pincushion flowers' for their unique appearance.",
  "habitat": "Scabiosa species are native to Europe, Asia, and Africa. They are often found in meadows, grasslands, and rocky slopes.",
  "species": "Common species include Scabiosa columbaria and Scabiosa atropurpurea.",
  "careTips": "Scabiosas prefer full sun and well-drained soil. Deadhead spent flowers to encourage continuous blooming. Divide clumps every few years to rejuvenate the plant and maintain vigor."
},
{
  "id": 62,
  "name": "Stock",
  "color": "White",
  "price": 9.99,
  "image": "./images/whitestock.jpg",
  "description": "Stock flowers represent a happy life and lasting beauty. They have a pleasant, spicy fragrance.",
  "habitat": "Stocks are native to Mediterranean regions but are cultivated worldwide for their ornamental value.",
  "species": "The most common species of Stock cultivated for ornamental purposes is Matthiola incana.",
  "careTips": "Stocks prefer full sun to partial shade and well-drained soil. Water regularly, especially during dry periods, but avoid overwatering to prevent root rot. Deadhead spent flowers to encourage continuous blooming and prevent self-seeding."
},
{
  "id": 63,
  "name": "Sweet William",
  "color": "Red",
  "price": 5.99,
  "image": "./images/sweetwilliam.jpg",
  "description": "Sweet William symbolizes gallantry and finesse. They are known for their vibrant, clustered blooms.",
  "habitat": "Sweet Williams are native to Europe, Asia, and North Africa, and they are often found in meadows, grasslands, and rocky slopes.",
  "species": "The most common species cultivated for ornamental purposes is Dianthus barbatus.",
  "careTips": "Sweet Williams prefer full sun to partial shade and well-drained soil. Water regularly, especially during dry periods, but avoid overwatering to prevent root rot. Deadhead spent flowers to encourage continuous blooming and prevent self-seeding."
},
{
  "id": 65,
  "name": "Verbena",
  "color": "Purple",
  "price": 7.49,
  "image": "./images/purpleverbena.jpg",
  "description": "Verbenas symbolize healing and creativity. They are known for their long blooming season and vibrant colors.",
  "habitat": "Verbenas are native to the Americas, Europe, and Asia. They are often found in meadows, prairies, and rocky slopes.",
  "species": "The most commonly cultivated species for ornamental purposes is Verbena bonariensis.",
  "careTips": "Verbenas prefer full sun and well-drained soil. They are drought-tolerant once established but benefit from regular watering during dry periods. Deadhead spent flowers to encourage continuous blooming."
},
{
  "id": 66,
  "name": "Wallflower",
  "color": "Yellow",
  "price": 6.49,
  "image": "./images/yellowwallflower.jpg",
  "description": "Wallflowers represent fidelity and affection. They are fragrant and often used in cottage gardens.",
  "habitat": "Wallflowers are native to Europe and western Asia, and they are often found growing in rocky areas, cliffs, and along roadsides.",
  "species": "The most common species cultivated for ornamental purposes is Erysimum cheiri.",
  "careTips": "Wallflowers prefer full sun and well-drained soil. They are drought-tolerant once established but benefit from regular watering during dry periods. Deadhead spent flowers to encourage continuous blooming and prevent self-seeding."
},
{
  "id": 69,
  "name": "Aster",
  "color": "Purple",
  "price": 8.49,
  "image": "./images/purpleaster.jpg",
  "description": "Asters symbolize patience and elegance. They have star-shaped flowers that bloom in late summer and fall.",
  "habitat": "Asters are native to North America, Europe, and Asia, and they are often found in meadows, woodlands, and along roadsides.",
  "species": "There are over 180 species of Aster, including both annuals and perennials.",
  "careTips": "Asters prefer full sun and well-drained soil. Water regularly, especially during dry periods, but avoid overwatering to prevent root rot. Divide clumps every few years to rejuvenate the plant and maintain vigor."
},
{
  "id": 70,
  "name": "Borage",
  "color": "Blue",
  "price": 6.49,
  "image": "./images/blueborage.jpg",
  "description": "Borage represents courage and bravery. It has bright blue, star-shaped flowers that attract bees.",
  "habitat": "Borage is native to the Mediterranean region and is often found growing in fields, gardens, and along roadsides.",
  "species": "The botanical name for Borage is Borago officinalis.",
  "careTips": "Borage prefers full sun and well-drained soil. It is drought-tolerant once established but benefits from regular watering during dry periods. Deadhead spent flowers to encourage continuous blooming."
},
{
  "id": 71,
  "name": "Darwin Hybrid Tulip",
  "color": "Red",
  "price": 9.99,
  "image": "./images/darwinhybridtulip.jpg",
  "description": "Darwin Hybrid Tulips are known for their large blooms and vibrant colors. They are ideal for garden displays and cut flowers.",
  "habitat": "Darwin Hybrid Tulips are cultivated varieties derived from Tulipa fosteriana and Tulipa gesneriana, native to Turkey, Iran, and other parts of Asia.",
  "species": "Darwin Hybrid Tulips are hybrids created by crossing Tulipa fosteriana and Tulipa gesneriana.",
  "careTips": "Darwin Hybrid Tulips prefer full sun to partial shade and well-drained soil. Plant bulbs in the fall for spring blooms, and water sparingly to avoid rotting bulbs. Deadhead spent flowers to promote bulb growth and prevent self-seeding."
},
{
  "id": 72,
  "name": "Parrot Tulip",
  "color": "Multicolor",
  "price": 11.99,
  "image": "./images/parrottulip.jpg",
  "description": "Parrot Tulips feature fringed and ruffled petals with bold, multicolored patterns. They are perfect for adding a dramatic touch to any bouquet.",
  "habitat": "Parrot Tulips are cultivated varieties derived from various species of Tulipa, native to Turkey, Iran, and other parts of Asia.",
  "species": "Parrot Tulips are hybrids created by selective breeding to produce unique, showy flowers.",
  "careTips": "Parrot Tulips prefer full sun to partial shade and well-drained soil. Plant bulbs in the fall for spring blooms, and water sparingly to avoid rotting bulbs. Deadhead spent flowers to promote bulb growth and prevent self-seeding."
} ,
{
  "id": 73,
  "name": "Fosteriana Tulip",
  "color": "Orange",
  "price": 8.99,
  "image": "./images/fosterianatulip.jpg",
  "description": "Fosteriana Tulips are admired for their elegant, elongated petals and early blooming season. They bring a bright splash of color to spring gardens.",
  "habitat": "Fosteriana Tulips are native to Central Asia and were first cultivated in Turkey. They thrive in well-drained soil and sunny locations.",
  "species": "Fosteriana Tulips belong to the Tulipa fosteriana species, characterized by their large flowers and sturdy stems.",
  "careTips": "Fosteriana Tulips prefer full sun and well-drained soil. Plant bulbs in the fall, placing them 6-8 inches deep and 4-6 inches apart. Water thoroughly after planting and keep the soil moist but not waterlogged during the growing season. Apply a balanced fertilizer in early spring to promote healthy growth and flowering. Deadhead spent blooms to encourage the plant to put energy into bulb formation."
},
{
  "id": 74,
  "name": "Lily-Flowered Tulip",
  "color": "Pink",
  "price": 10.99,
  "image": "./images/lilyfloweredtulip.jpg",
  "description": "Lily-Flowered Tulips have pointed petals that gracefully curve outwards, resembling lilies. They add a touch of sophistication to any floral arrangement.",
  "habitat": "Lily-Flowered Tulips are cultivated varieties derived from various species of tulips, including Tulipa bakeri and Tulipa aucheriana.",
  "species": "Lily-Flowered Tulips belong to the Tulipa liliiflora group, characterized by their elegant, flared petals and graceful form.",
  "careTips": "Lily-Flowered Tulips prefer full sun to partial shade and well-drained soil. Plant bulbs in the fall, placing them 6-8 inches deep and 4-6 inches apart. Water thoroughly after planting and keep the soil moist but not waterlogged during the growing season. Apply a balanced fertilizer in early spring to promote healthy growth and flowering. Deadhead spent blooms to encourage the plant to put energy into bulb formation."
},
{
  "id": 75,
  "name": "Double Early Tulip",
  "color": "Pink",
  "price": 9.49,
  "image": "./images/doubleearlytulip.jpg",
  "description": "Double Early Tulips are characterized by their full, peony-like blooms and early flowering period. They are excellent for creating lush, colorful displays.",
  "habitat": "Double Early Tulips are cultivated varieties derived from various species of tulips, including Tulipa gesneriana and Tulipa fosteriana.",
  "species": "Double Early Tulips belong to the Tulipa gesneriana group, characterized by their large, double flowers and sturdy stems.",
  "careTips": "Double Early Tulips prefer full sun and well-drained soil. Plant bulbs in the fall, placing them 6-8 inches deep and 4-6 inches apart. Water thoroughly after planting and keep the soil moist but not waterlogged during the growing season. Apply a balanced fertilizer in early spring to promote healthy growth and flowering. Deadhead spent blooms to encourage the plant to put energy into bulb formation."
},
{
  "id": 76,
  "name": "Hybrid Tea Rose",
  "color": "Red",
  "price": 12.99,
  "image": "./images/hybridtearose.jpg",
  "description": "Hybrid Tea Roses are known for their large, high-centered blooms and long stems, making them perfect for cut flowers.",
  "habitat": "Hybrid Tea Roses are cultivated varieties derived from crosses between hybrid perpetual roses and tea roses. They thrive in sunny locations with well-drained soil.",
  "species": "Hybrid Tea Roses belong to the Rosa hybrida group, characterized by their large, high-centered flowers and long stems.",
  "careTips": "Hybrid Tea Roses prefer full sun and well-drained soil. Water deeply and regularly, especially during dry periods. Prune regularly to remove dead or diseased wood and encourage new growth. Apply a balanced fertilizer in early spring and again after the first flush of blooms to promote continuous flowering. Protect from frost in colder climates."
},
{
  "id": 77,
  "name": "Floribunda Rose",
  "color": "Pink",
  "price": 11.99,
  "image": "./images/floribundarose.jpg",
  "description": "Floribunda Roses produce clusters of blooms and are prized for their prolific flowering and vibrant colors.",
  "habitat": "Floribunda Roses are cultivated varieties derived from crosses between hybrid tea roses and polyantha roses. They thrive in sunny locations with well-drained soil.",
  "species": "Floribunda Roses belong to the Rosa hybrida group, characterized by their clustered blooms and compact growth habit.",
  "careTips": "Floribunda Roses prefer full sun and well-drained soil. Water deeply and regularly, especially during dry periods. Prune regularly to remove dead or diseased wood and encourage new growth. Apply a balanced fertilizer in early spring and again after the first flush of blooms to promote continuous flowering. Deadhead spent blooms to encourage the plant to produce more flowers."
},
{
  "id": 78,
  "name": "Grandiflora Rose",
  "color": "Pink",
  "price": 13.49,
  "image": "./images/grandiflorarose.jpg",
  "description": "Grandiflora Roses are a cross between Hybrid Tea and Floribunda, offering large blooms and multiple flowers per stem.",
  "habitat": "Grandiflora Roses are cultivated varieties derived from crosses between hybrid tea roses and floribunda roses. They thrive in sunny locations with well-drained soil.",
  "species": "Grandiflora Roses belong to the Rosa hybrida group, characterized by their large, single or clustered blooms and tall growth habit.",
  "careTips": "Grandiflora Roses prefer full sun and well-drained soil. Water deeply and regularly, especially during dry periods. Prune regularly to remove dead or diseased wood and encourage new growth. Apply a balanced fertilizer in early spring and again after the first flush of blooms to promote continuous flowering. Deadhead spent blooms to encourage the plant to produce more flowers."
},
{
  "id": 79,
  "name": "Climbing Rose",
  "color": "Yellow",
  "price": 14.99,
  "image": "./images/climbingrose.jpg",
  "description": "Climbing Roses are ideal for trellises and arbors, with long canes that can be trained to grow vertically.",
  "habitat": "Climbing Roses are cultivated varieties derived from various species of roses, including Rosa multiflora and Rosa banksiae. They thrive in sunny locations with well-drained soil.",
  "species": "Climbing Roses belong to the Rosa hybrida group, characterized by their long, flexible canes and ability to climb and cover structures.",
  "careTips": "Climbing Roses prefer full sun and well-drained soil. Provide support for the canes by tying them to a trellis or arbor. Prune regularly to remove dead or diseased wood and encourage new growth. Apply a balanced fertilizer in early spring and again after the first flush of blooms to promote continuous flowering. Train new canes horizontally to encourage lateral growth and more blooms."
},
{
  "id": 80,
  "name": "Miniature Rose",
  "color": "Red",
  "price": 9.99,
  "image": "./images/miniaturerose.jpg",
  "description": "Miniature Roses are smaller in size but offer the same beauty and fragrance as larger roses, perfect for containers and small gardens.",
  "habitat": "Miniature Roses are cultivated varieties derived from various species of roses, primarily Rosa chinensis and Rosa multiflora.",
  "species": "Miniature Roses are hybrids created by selective breeding to produce compact roses suitable for small gardens and containers.",
  "careTips": "Miniature Roses prefer full sun and well-drained soil. Water deeply and regularly, especially during dry periods. Prune regularly to remove dead or diseased wood and encourage new growth. Apply a balanced fertilizer during the growing season to promote healthy blooms. Protect from frost in colder climates."
}

  ]
}

 
  